from django.shortcuts import render
from django.views import View

from contract.models import Contract
from project import settings


class MapView(View):

    template_name = 'map.html'

    map = {
        'Белгородская область': 'fregion,RU-BEL,Белгородскаяобласть,651,{}',
        'Брянская область': 'fregion,RU-BRY,Брянскаяобласть,875,{}',
        'Владимирская область': 'fregion,RU-VLA,Владимирскаяобласть,1283,{}',
        'Воронежская область': 'fregion,RU-VOR,Воронежскаяобласть,1172,{}',
        'Ивановская область': 'fregion,RU-IVA,Ивановскаяобласть,1097,{}',
        'Калужская область': 'fregion,RU-KLU,Калужскаяобласть,1225,{}',
        'Костромская область': 'fregion,RU-KOS,Костромскаяобласть,371,{}',
        'Курская область': 'fregion,RU-KRS,Курскаяобласть,556,{}',
        'Липецкая область': 'fregion,RU-LIP,Липецкаяобласть,673,{}',
        'Москва': 'fregion, RU-MOW,Москва,151313,{}',
        'Московская область': 'fregion,RU-MOS,Московскаяобласть,25961,{}',
        'Орловская область': 'fregion,RU-ORL,Орловскаяобласть,548,{}',
        'Рязанская область': 'fregion,RU-RYA,Рязанскаяобласть,1080,{}',
        'Смоленская область': 'fregion,RU-SMO,Смоленскаяобласть,964,{}',
        'Тамбовская область': 'fregion,RU-TAM,Тамбовскаяобласть,736,{}',
        'Тверская область': 'fregion,RU-TVE,Тверскаяобласть,1212,{}',
        'Тульская область': 'fregion,RU-TUL,Тульскаяобласть,1564,{}',
        'Ярославская область': 'fregion,RU-YAR,Ярославскаяобласть,1157,{}',
        'Центральный округ': 'fdistrict,Central,Центральныйокруг,54493,{}',

        'Республика Карелия': 'fregion,RU-KR,Республика Карелия,861,{}',
        'Республика Коми': 'fregion,RU-KO,Республика Коми,1675,{}',
        'Архангельская область': 'fregion,RU-ARK,Архангельская область,2133,{}',
        'Вологодская область': 'fregion,RU-VLG,Вологодская область,1986,{}',
        'Калининградская область': 'fregion,RU-KGD,Калининградская область,1327,{}',
        'Ленинградская область': 'fregion,RU-LEN,Ленинградская область,3576,{}',
        'Санкт-Петербург': 'fregion,RU-SPE,Санкт-Петербург,8288,{}',
        'Мурманская область': 'fregion,RU-MUR,Мурманская область,969,{}',
        'Новгородская область': 'fregion,RU-NGR,Новгородская область,1470,{}',
        'Псковская область': 'fregion,RU-PSK,Псковская область,1635,{}',
        'Ненецкий авт.округ': 'fregion,RU-NEN,Ненецкий авт.округ,43,{}',
        'Северо-Западный округ': 'fdistrict,Northwestern,Северо-Западный округ,23963,{}',
        'Республика Адыгея': 'fregion,RU-AD,Республика Адыгея,540,{}',
        'Республика Калмыкия': 'fregion,RU-KL,Республика Калмыкия,692,{}',
        'Краснодарский край': 'fregion,RU-KDA,Краснодарский край,6710,{}',
        'Астраханская область': 'fregion,RU-AST,Астраханская область,1763,{}',
        'Волгоградская область': 'fregion,RU-VGG,Волгоградская область,3052,{}',
        'Ростовская область': 'fregion,RU-ROS,Ростовская область,6183,{}',
        'Южный округ': 'fdistrict,Southern,Южный округ,18940,{}',
        'Республика Дагестан': 'fregion,RU-DA,Республика Дагестан,1419,{}',
        'Республика Ингушетия': 'fregion,RU-IN,Республика Ингушетия,235,{}',
        'Кабардино-Балкарская Республика': 'fregion,RU-KB,Кабардино-Балкарская Республика,837,{}',
        'Карачаево-Черкесская Республика': 'fregion,RU-KC,Карачаево-Черкесская Республика,642,{}',
        'Республика Северная Осетия': 'fregion,RU-SE,Республика Северная Осетия,769,{}',
        'Чеченская Республика': 'fregion,RU-CE,Чеченская Республика,387,{}',
        'Чеченская Республика и Республика Ингушетия': 'fregion,RU-CE & RU-IN,Чеченская Республика и Республика Ингушетия,652,{}',
        'Ставропольский край': 'fregion,RU-STA,Ставропольский край,2912,{}',
        'Северо-Кавказский округ': 'fdistrict,Northcaucasian,Северо-Кавказский округ,7201,{}',
        'Республика Башкортостан': 'fregion,RU-BA,Республика Башкортостан,5115,{}',
        'Республика Марий Эл': 'fregion,RU-ME,Республика Марий Эл,1113,{}',
        'Республика Мордовия': 'fregion,RU-MO,Республика Мордовия,1104,{}',
        'Республика Татарстан': 'fregion,RU-TA,Республика Татарстан,5483,{}',
        'Удмуртская Республика': 'fregion,RU-UD,Удмуртская Республика,1524,{}',
        'Чувашская Республика': 'fregion,RU-CU,Чувашская Республика,2061,{}',
        'Пермский край': 'fregion,RU-PER,Пермский край,3898,{}',
        'Кировская область': 'fregion,RU-KIR,Кировская область,2093,{}',
        'Нижегородская область': 'fregion,RU-NIZ,Нижегородская область,5215,{}',
        'Оренбургская область': 'fregion,RU-ORE,Оренбургская область,2449,{}',
        'Пензенская область': 'fregion,RU-PNZ,Пензенская область,2251,{}',
        'Самарская область': 'fregion,RU-SAM,Самарская область,4600,{}',
        'Саратовская область': 'fregion,RU-SAR,Саратовская область,2605,{}',
        'Ульяновская область': 'fregion,RU-ULY,Ульяновская область,2199,{}',
        'Приволжский округ': 'fdistrict,Volga,Приволжский округ,41710,{}',
        'Курганская область': 'fregion,RU-KGN,Курганская область,1410,{}',
        'Свердловская область': 'fregion,RU-SVE,Свердловская область,5387,{}',
        'Тюменская область': 'fregion,RU-TYU,Тюменская область,3431,{}',
        'Челябинская область': 'fregion,RU-CHE,Челябинская область,4924,{}',
        'Ханты-мансийский авт.округ': 'fregion,RU-KHM,Ханты-мансийский авт.округ,2462,{}',
        'Ямало-ненецкий авт.округ': 'fregion,RU-YAN,Ямало-ненецкий авт.округ,743,{}',
        'Уральский округ': 'fdistrict,Urals,Уральский округ,18357,{}',
        'Республика Алтай': 'fregion,RU-AL,Республика Алтай,436,{}',
        'Республика Бурятия': 'fregion,RU-BU,Республика Бурятия,1463,{}',
        'Республика Тыва': 'fregion,RU-TY,Республика Тыва,337,{}',
        'Республика Хакасия': 'fregion,RU-KK,Республика Хакасия,1170,{}',
        'Алтайский край': 'fregion,RU-ALT,Алтайский край,3778,{}',
        'Забайкальский край': 'fregion,RU-ZAB,Забайкальский край,1287,{}',
        'Красноярский край': 'fregion,RU-KYA,Красноярский край,5135,{}',
        'Иркутская область': 'fregion,RU-IRK,Иркутская область,3420,{}',
        'Кемеровская область': 'fregion,RU-KEM,Кемеровская область,3913,{}',
        'Новосибирская область': 'fregion,RU-NVS,Новосибирская область,2637,{}',
        'Омская область': 'fregion,RU-OMS,Омская область,3377,{}',
        'Томская область': 'fregion,RU-TOM,Томская область,952,{}',
        'Сибирский округ': 'fdistrict,Siberia,Сибирский округ,27905,{}',
        'Республика Саха (Якутия)': 'fregion,RU-SA,Республика Саха (Якутия),932,{}',
        'Приморский край': 'fregion,RU-PRI,Приморский край,4370,{}',
        'Камчатский край': 'fregion,RU-KAM,Камчатский край,655,{}',
        'Хабаровский край': 'fregion,RU-KHA,Хабаровский край,2203,{}',
        'Амурская область': 'fregion,RU-AMU,Амурская область,1367,{}',
        'Магаданская область': 'fregion,RU-MAG,Магаданская область,314,{}',
        'Сахалинская область': 'fregion,RU-SAK,Сахалинская область,760,{}',
        'Еврейская автономная область': 'fregion,RU-YEV,Еврейская автономная область,403,{}',
        'Чукотский авт.округ': 'fregion,RU-CHU,Чукотский авт.округ,24,{}',
        'Дальневосточный округ': 'fdistrict,Far_Eastern,Дальневосточный округ,11028,{}',
    }

    def get(self, request):
        queryset_data = Contract.objects.data_for_map()

        for item in queryset_data:
            if item['region_name'] in self.map:
                self.map[item['region_name']] = (
                    self.map[item['region_name']].format(
                        round(item['sum_cost'], 2)
                    )
                )

        for key, value in self.map.items():
            if '{}' in value:
                self.map[key] = value.format('0')

        with open(settings.BASE_DIR / 'static/zak4.csv', 'w') as f:
            f.write('Rtype,RegionCode,RegionName,CarAccidents,Deaths\n')
            f.write(
                'federation,Russian Federation,Российская Федерация,203597,27991\n'
            )

            for key, value in self.map.items():
                f.write(value + '\n')
        return render(request, self.template_name)
